package lecture01.homework.task01;

/*
Заключение контракта
Задание: вывести на экран текст
*/

public class Task01Solution05 {

    public static void main(String[] args) {
        System.out.println("Меня зовут Амиго.");
        System.out.println(" ");
        System.out.println("Я согласен на зарплату $10/месяц в первый год.");
        System.out.println("Я согласен на зарплату $20/месяц во второй год.");
        System.out.println("Я согласен на зарплату $30/месяц в третий год.");
        System.out.println("Я согласен на зарплату $40/месяц в четвертый год.");
        System.out.println("Я согласен на зарплату $50/месяц в пятый год.");
        System.out.println(" ");
        System.out.println("Спасибо за щедрость, друг Риша!");
    }
}
