package lecture01.homework.task03;
//package com.javarush.task.task03.task0324;

/* Я хочу изучать Java и хочу большую зарплату
Вывести на экран десять раз надпись «Я хочу изучать Java и хочу большую зарплату»
 */


public class Task03Solution16 {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("Я хочу большую зарплату и для этого изучаю Java");
        }
    }
}
