package lecture01.homework.task03;

/* Чистая любовь
Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
 */


public class Task03Solution15 {
    public static void main(String[] args) {
            System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
