package lecture01.homework.task03;
//package com.javarush.task.task03.task0305;

/*Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012*/

public class Task03Solution01 {
    public static void main(String[] args) {
        System.out.print("MAY 1 2012");
    }
}
